---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricSheetLength
source: html/1c9b215c-7540-1cd7-0524-6e31cfd2a147.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricSheetLength Property

"Length": Length

## Syntax (C#)
```csharp
public static ForgeTypeId FabricSheetLength { get; }
```